ka2_2024/src/Catalogs/КлассификаторПАТСАТУРН/КлассификаторПАТСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторПАТСАТУРН</name>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКПД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукцииСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регистрант</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГосударственнойРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействующееВещество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрепаративнаяФорма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеДействующегоВещества</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассОпасности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийСАТУРН</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставТукосмеси</name>
    <attributes>
      <name>ПА</name>
      <comment>Компонент тукосмеси</comment>
      <type>
        <types>CatalogRef.КлассификаторПАТСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ka2_2024/src/Enums/ВидыПродукцииСАТУРН/ВидыПродукцииСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПродукцииСАТУРН</name>
  <enumValues>
    <name>Агрохимикат</name>
  </enumValues>
  <enumValues>
    <name>Пестицид</name>
  </enumValues>
  <enumValues>
    <name>Тукосмесь</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Catalogs/КлассификаторПАТСАТУРН/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	КоличествоСоставляющихТукосмеси = СоставТукосмеси.Количество();

	Если Не ВидПродукции = Перечисления.ВидыПродукцииСАТУРН.Тукосмесь Тогда
		ПроверяемыеРеквизиты.Удалить("СоставТукосмеси");
	ИначеЕсли КоличествоСоставляющихТукосмеси < 2 Тогда
		
		Шаблон = НСтр("ru = 'Количество ПА в составе тукосмеси - %1. 
					  |Должно быть не менее 2.'");
		
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(Шаблон, Формат(КоличествоСоставляющихТукосмеси, "ЧДЦ=0; ЧГ=3,0;")),,
			"СоставТукосмеси",,
			Отказ);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
